package java20220819.exam04;

public class Socket1 {
/*
 * 소켓 서버소켓 다르다
 * -----------------
 * 서버소켓 만들고 대기
 * 클라이언트소켓이 대화요청시
 * 서버가 어셉트
 * 이후 클라이언트소켓만큼(여기까지가 서버소켓의 역할)
 * 
 * 클라이언트쪽 롸이트
 * 서버 뤼드 롸이트
 * 클라이언트 리드
 * 
 * 클로즈
 * -----------------
 * 서버소켓은 연결요청을 수락하고 소켓을 반환하고 클로즈
 *  이즈바운드로 연결되있는지 확인
 * 순서기억해야된대
 * -----------------
 * 
 * 소켓 프로그래밍
 * 
 * 클라이언트가 서버에 접속을 시도
 * 포트번호ㅗ 들어가서 서버와 대화
 * 
 * ------------
 * 소켓으로 소통해도되겠니?라고 물음
 * 서버쪽에 아이피가 있어야 찾아간다
 * 
 * 
 * 이제부터 서버와 클라이언트 두개가있어야함
 * 스트림 붙으면 어전에 했던것과 동일한 작업을 할수있따
 * 
 * 클라이언트에서 내보내면 서버에서 받아드리고
 * 서버가 받아드리면 클라이언트로 내보내야한다
 * --------------------------
 * 
 * 1. 서버쪽은 서버소켓이 필요
 * 어셉하고 
 * 서버부터 먼저실행
 * 
 * 2.아웃풋스트림으로
 * 클라이언트 실행
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 */
}
